Repository: AutoPilot-ZUTF/RandList
Catalog: src/main/resources/swift/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, zh_hans, zh_hant

# action_generate
source: Generate
de: Generieren
es: Generar
fr: Générer
ja: 生成
ko: 생성
pt_br: Gerar
zh_hans: 生成
zh_hant: 生成

# appearance_dark
source: Dark
de: Dunkel
es: Oscuro
fr: Sombre
ja: 深色
ko: 다크
pt_br: Escuro
zh_hans: 深色
zh_hant: 深色

# appearance_light
source: Light
de: Hell
es: Claro
fr: Clair
ja: 浅色
ko: 라이트
pt_br: Claro
zh_hans: 浅色
zh_hant: 淺色

# appearance_system
source: Follow System
de: System folgen
es: Seguir el sistema
fr: Suivre le système
ja: システムに従う
ko: 시스템 설정 따르기
pt_br: Seguir o sistema
zh_hans: 跟随系统
zh_hant: 跟隨系統

# common_copied
source: Copied
de: Kopiert
es: Copiado
fr: Copié
ja: コピー済み
ko: 복사됨
pt_br: Copiado
zh_hans: 已复制
zh_hant: 已複製

# common_delete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
pt_br: Excluir
zh_hans: 删除
zh_hant: 刪除

# common_hide_keyboard
source: Hide Keyboard
de: Schließen
es: Ocultar teclado
fr: Masquer le clavier
ja: キーボードを隠す
ko: 키보드 숨기기
pt_br: Ocultar teclado
zh_hans: 隐藏键盘
zh_hant: 隱藏鍵盤

# error_amount_below_included_count
source: Amount must be greater than or equal to the number of included values.
de: Die Anzahl muss größer oder gleich der Anzahl enthaltener Werte sein.
es: La cantidad debe ser mayor o igual que el número de valores incluidos.
fr: La quantité doit être supérieure ou égale au nombre de valeurs incluses.
ja: 個数は含める値の数以上である必要があります。
ko: 개수는 포함된 값의 수 이상이어야 합니다.
pt_br: A quantidade deve ser maior ou igual ao número de valores incluídos.
zh_hans: 数量必须大于或等于包含值的数量.
zh_hant: 數量必須大於或等於包含值的數量。

# error_amount_exceeds_available
source: Amount must not exceed the number of available values.
de: Die Anzahl darf die Zahl der verfügbaren Werte nicht überschreiten.
es: La cantidad no debe superar el número de valores disponibles.
fr: La quantité ne doit pas dépasser le nombre de valeurs disponibles.
ja: 個数は利用可能な値の数を超えてはいけません。
ko: 개수는 사용 가능한 값의 수를 초과할 수 없습니다.
pt_br: A quantidade não deve exceder o número de valores disponíveis.
zh_hans: 数量不能超过可用值的数量.
zh_hant: 數量不能超過可用值的數量。

# error_amount_range
source: Amount must be greater than 0.
de: Die Anzahl muss größer als 0 sein.
es: La cantidad debe ser mayor que 0.
fr: La quantité doit être supérieure à 0.
ja: 個数は 0 より大きい必要があります。
ko: 개수는 0보다 커야 합니다.
pt_br: A quantidade deve ser maior que 0.
zh_hans: 数量必须大于 0.
zh_hant: 數量必須大於 0。

# error_excluded_values_too_many
source: Excluded values leave too few available values.
de: Durch die ausgeschlossenen Werte bleiben zu wenige verfügbare Werte übrig.
es: Los valores excluidos dejan muy pocos valores disponibles.
fr: Les valeurs exclues laissent trop peu de valeurs disponibles.
ja: 除外する値が多すぎて、利用可能な値が足りません。
ko: 제외된 값이 너무 많아 사용 가능한 값이 부족합니다.
pt_br: Os valores excluídos deixam poucos valores disponíveis.
zh_hans: 排除值过多，剩余可用值不足.
zh_hant: 排除值過多，剩餘可用值不足。

# error_input_bound
source: Lower bound must be less than upper bound.
de: Die Untergrenze muss kleiner als die Obergrenze sein.
es: El límite inferior debe ser menor que el límite superior.
fr: La borne inférieure doit être inférieure à la borne supérieure.
ja: 下限は上限より小さくなければなりません。
ko: 하한은 상한보다 작아야 합니다.
pt_br: O limite inferior deve ser menor que o limite superior.
zh_hans: 下界必须小于上界.
zh_hant: 下界必須小於上界。

# error_lower_bound_range
source: Lower bound must be greater than or equal to 0.
de: Die Untergrenze muss größer oder gleich 0 sein.
es: El límite inferior debe ser mayor o igual que 0.
fr: La borne inférieure doit être supérieure ou égale à 0.
ja: 下限は 0 以上である必要があります。
ko: 하한은 0 이상이어야 합니다.
pt_br: O limite inferior deve ser maior ou igual a 0.
zh_hans: 下界必须大于或等于 0.
zh_hant: 下界必須大於或等於 0。

# error_specified_items_empty
source: Specified items must not be empty.
de: Angegebene Elemente dürfen nicht leer sein.
es: Los elementos especificados no deben estar vacíos.
fr: Les éléments spécifiés ne doivent pas être vides.
ja: 指定項目は空にできません。
ko: 지정된 항목은 비워 둘 수 없습니다.
pt_br: Os itens especificados não podem estar vazios.
zh_hans: 指定项目不能为空.
zh_hant: 指定項目不能為空。

# error_unsupported_mode
source: This mode cannot generate results.
de: Dieser Modus kann keine Ergebnisse erzeugen.
es: Este modo no puede generar resultados.
fr: Ce mode ne peut pas générer de résultats.
ja: このモードでは結果を生成できません。
ko: 이 모드에서는 결과를 생성할 수 없습니다.
pt_br: Este modo não pode gerar resultados.
zh_hans: 此模式无法生成结果.
zh_hant: 此模式無法生成結果。

# error_upper_bound_range
source: Upper bound must be greater than 0.
de: Die Obergrenze muss größer als 0 sein.
es: El límite superior debe ser mayor que 0.
fr: La borne supérieure doit être supérieure à 0.
ja: 上限は 0 より大きい必要があります。
ko: 상한은 0보다 커야 합니다.
pt_br: O limite superior deve ser maior que 0.
zh_hans: 上界必须大于 0.
zh_hant: 上界必須大於 0。

# error_values_duplicate
source: Values must not contain duplicates.
de: Werte dürfen keine Duplikate enthalten.
es: Los valores no deben contener duplicados.
fr: Les valeurs ne doivent pas contenir de doublons.
ja: 値に重複を含めることはできません。
ko: 값에는 중복이 있으면 안 됩니다.
pt_br: Os valores não podem conter duplicados.
zh_hans: 值列表不能包含重复项.
zh_hant: 值列表不能包含重複項。

# error_values_out_of_bounds
source: Values must stay within the selected bounds.
de: Werte müssen innerhalb der ausgewählten Grenzen liegen.
es: Los valores deben mantenerse dentro de los límites seleccionados.
fr: Les valeurs doivent rester dans les bornes sélectionnées.
ja: 値は選択した範囲内でなければなりません。
ko: 값은 선택한 범위 내에 있어야 합니다.
pt_br: Os valores devem permanecer dentro dos limites selecionados.
zh_hans: 值必须位于所选范围内.
zh_hant: 值必須位於所選範圍內。

# field_amount
source: Amount
de: Anzahl
es: Cantidad
fr: Quantité
ja: 個数
ko: 개수
pt_br: Quantidade
zh_hans: 数量
zh_hant: 數量

# field_integer_hint
source: Integer
de: Ganze Zahl
es: Número entero
fr: Nombre entier
ja: 整数
ko: 정수
pt_br: Número inteiro
zh_hans: 整数
zh_hant: 整數

# field_integer_list_hint
source: Integer List: x,y,z...
de: Ganzzahlliste: x,y,z...
es: Lista de enteros: x,y,z...
fr: Liste d’entiers : x,y,z...
ja: 整数リスト: x,y,z...
ko: 정수 목록: x,y,z...
pt_br: Lista de inteiros: x,y,z...
zh_hans: 整数列表: x,y,z...
zh_hant: 整數列表: x,y,z...

# field_list_prompt
source: Use commas or new lines.
de: Kommas oder Zeilenumbrüche verwenden.
es: Usa comas o saltos de línea.
fr: Utilisez des virgules ou des retours à la ligne.
ja: カンマまたは改行で区切ってください。
ko: 쉼표나 줄바꿈으로 구분하세요.
pt_br: Use vírgulas ou quebras de linha.
zh_hans: 使用逗号或换行分隔.
zh_hant: 使用逗號或換行分隔。

# field_string_list_hint
source: String List: a,ß,text...
de: Textliste: a,ß,text...
es: Lista de texto: a,ß,text...
fr: Liste de texte : a,ß,text...
ja: 文字列リスト: a,ß,text...
ko: 문자열 목록: a,ß,text...
pt_br: Lista de texto: a,ß,text...
zh_hans: 字符串列表: a,ß,其他…
zh_hant: 字串列表: a,ß,text...

# history_boundary
source: Boundary
de: Bereich
es: Límite
fr: Plage
ja: 範囲
ko: 범위
pt_br: Intervalo
zh_hans: 取值范围
zh_hant: 邊界

# history_day_today
source: Today
de: Heute
es: Hoy
fr: Aujourd’hui
ja: 今日
ko: 오늘
pt_br: Hoje
zh_hans: 今天
zh_hant: 今天

# history_day_yesterday
source: Yesterday
de: Gestern
es: Ayer
fr: Hier
ja: 昨日
ko: 어제
pt_br: Ontem
zh_hans: 昨天
zh_hant: 昨天

# history_empty_message
source: Generated entries from every mode will appear here.
de: Hier erscheinen erzeugte Einträge aus allen Modi.
es: Las entradas generadas de todos los modos aparecerán aquí.
fr: Les entrées générées de tous les modes apparaîtront ici.
ja: すべてのモードで生成された履歴がここに表示されます。
ko: 모든 모드에서 생성된 기록이 여기에 표시됩니다.
pt_br: As entradas geradas de todos os modos aparecerão aqui.
zh_hans: 所有模式生成的记录都会显示在这里.
zh_hant: 所有模式產生的記錄都會顯示在這裡。

# history_empty_title
source: No history yet
de: Noch kein Verlauf
es: Aún no hay historial
fr: Aucun historique pour le moment
ja: まだ履歴はありません
ko: 아직 기록이 없습니다
pt_br: Ainda não há histórico
zh_hans: 暂无历史记录
zh_hant: 暫無歷史記錄

# history_help_message
source: Generated results appear here grouped by day. Entries with the same mode and inputs are merged together, and you can swipe left to delete a group.
de: Hier werden generierte Ergebnisse nach Tag gruppiert angezeigt. Elemente mit demselben Modus und denselben Eingaben werden zusammengefasst, und du kannst nach links wischen, um einen Eintrag zu löschen.
es: Los resultados generados aparecen aquí agrupados por día. Las entradas con el mismo modo y las mismas entradas se combinan, y puedes deslizar a la izquierda para eliminar un grupo.
fr: Les résultats générés apparaissent ici, regroupés par jour. Les entrées avec le même mode et les mêmes paramètres sont fusionnées, et vous pouvez balayer vers la gauche pour supprimer un groupe.
ja: 生成結果は日ごとにまとめてここに表示されます。同じモードと入力の項目はひとつにまとめられ、左にスワイプしてグループを削除できます。
ko: 생성된 결과는 날짜별로 묶여 여기에 표시됩니다. 같은 모드와 입력을 가진 항목은 함께 합쳐지며, 왼쪽으로 쓸어 그룹을 삭제할 수 있습니다.
pt_br: Os resultados gerados aparecem aqui agrupados por dia. Entradas com o mesmo modo e os mesmos dados são mescladas, e você pode deslizar para a esquerda para excluir um grupo.
zh_hans: 生成结果会按天分组显示在这里。相同模式和输入的记录会合并在一起，你可以左滑删除整组记录。
zh_hant: 產生結果會依天分組顯示在這裡。相同模式和輸入的記錄會合併在一起，你可以左滑刪除整組記錄。

# history_template_applied
source: Template Applied
de: Vorlage angewendet
es: Plantilla aplicada
fr: Modèle appliqué
ja: テンプレートを適用済み
ko: 템플릿 적용됨
pt_br: Modelo aplicado
zh_hans: 模板已应用
zh_hant: 範本已套用

# mode_exclude_title
source: Exclude Mode
de: Ausschlussmodus
es: Modo de exclusión
fr: Mode exclusion
ja: 除外モード
ko: 제외 모드
pt_br: Modo de exclusão
zh_hans: 排除模式
zh_hant: 排除模式

# mode_help_exclude_message
source: Set the lower and upper bounds, enter how many numbers to generate, then list the numbers you want to exclude. Excluded numbers will be skipped during generation.
de: Lege den unteren und oberen Grenzwert fest, gib an, wie viele Zahlen du ziehen möchtest, und trage dann die Zahlen ein, die ausgeschlossen werden sollen. Die ausgeschlossenen Zahlen werden beim Generieren übersprungen.
es: Define los límites inferior y superior, indica cuántos números quieres generar y luego escribe los números que deseas excluir. Los números excluidos se omitirán al generar.
fr: Définissez les bornes inférieure et supérieure, indiquez combien de nombres générer, puis saisissez les nombres à exclure. Les nombres exclus seront ignorés lors de la génération.
ja: 下限と上限を設定し、生成する個数を入力してから、除外したい数字を記入します。除外した数字は生成時にスキップされます。
ko: 하한과 상한을 설정하고 생성할 개수를 입력한 다음 제외할 숫자를 적으세요. 제외한 숫자는 생성할 때 건너뜁니다.
pt_br: Defina os limites inferior e superior, informe quantos números deseja gerar e depois liste os números que devem ser excluídos. Os números excluídos serão ignorados na geração.
zh_hans: 先设置下限和上限，再输入要生成的数量，然后填写要排除的数字列表。生成时会自动跳过这些被排除的数字。
zh_hant: 先設定下限和上限，再輸入要產生的數量，然後填寫要排除的數字清單。產生時會自動跳過這些被排除的數字。

# mode_help_include_message
source: Set the lower and upper bounds, enter the amount you want, then list the numbers that must be included. Those numbers will be forced into the result as long as the amount is large enough.
de: Lege den unteren und oberen Grenzwert fest, gib die gewünschte Anzahl ein und trage dann die Zahlen ein, die unbedingt enthalten sein sollen. Diese Zahlen werden in das Ergebnis aufgenommen, solange die Anzahl ausreicht.
es: Define los límites inferior y superior, indica la cantidad que deseas y luego escribe los números que deben incluirse. Esos números se forzarán en el resultado siempre que la cantidad sea suficiente.
fr: Définissez les bornes inférieure et supérieure, indiquez la quantité voulue, puis saisissez les nombres qui doivent être inclus. Ces nombres seront forcés dans le résultat tant que la quantité est suffisante.
ja: 下限と上限を設定し、必要な個数を入力してから、必ず含めたい数字を記入します。個数が足りていれば、その数字は結果に必ず含まれます。
ko: 하한과 상한을 설정하고 원하는 개수를 입력한 다음 반드시 포함할 숫자를 적으세요. 개수가 충분하면 그 숫자들은 결과에 반드시 포함됩니다.
pt_br: Defina os limites inferior e superior, informe a quantidade desejada e depois liste os números que devem ser incluídos. Esses números serão obrigatoriamente inseridos no resultado, desde que a quantidade seja suficiente.
zh_hans: 先设置下限和上限，再输入要生成的数量，然后填写必须包含的数字列表。只要数量足够，这些数字一定会出现在结果中。
zh_hant: 先設定下限和上限，再輸入要產生的數量，然後填寫必須包含的數字清單。只要數量足夠，這些數字一定會出現在結果中。

# mode_help_simple_message
source: Enter a lower bound, an upper bound, and how many numbers you want. The app will then generate random numbers within that range.
de: Gib einen unteren und oberen Grenzwert sowie die gewünschte Anzahl ein. Die App zieht dann zufällige Zahlen innerhalb dieses Bereichs.
es: Introduce un límite inferior, un límite superior y cuántos números deseas. La app generará números aleatorios dentro de ese rango.
fr: Saisissez une borne inférieure, une borne supérieure et le nombre souhaité. L’app générera ensuite des nombres aléatoires dans cette plage.
ja: 下限と上限、そして欲しい個数を入力します。アプリはその範囲内でランダムな数字を生成します。
ko: 하한과 상한, 그리고 원하는 개수를 입력하세요. 앱이 그 범위 안에서 무작위 숫자를 생성합니다.
pt_br: Informe um limite inferior, um limite superior e quantos números deseja. O app gerará números aleatórios dentro desse intervalo.
zh_hans: 输入下限、上限和需要生成的数量，应用会在这个范围内随机生成数字。
zh_hant: 輸入下限、上限和需要產生的數量，App 會在這個範圍內隨機產生數字。

# mode_help_specify_message
source: Enter a list of items and specify how many should be selected. The app will randomly choose only from the items you provide.
de: Trage eine Liste von Elementen ein und gib an, wie viele ausgewählt werden sollen. Die App zieht zufällig aus genau diesen angegebenen Einträgen.
es: Introduce una lista de elementos e indica cuántos deben seleccionarse. La app elegirá aleatoriamente solo entre los elementos que proporciones.
fr: Saisissez une liste d’éléments et indiquez combien doivent être sélectionnés. L’app choisira aléatoirement uniquement parmi les éléments fournis.
ja: 項目の一覧を入力し、その中からいくつ選ぶかを指定します。アプリは入力した項目だけを対象にランダムで選択します。
ko: 항목 목록을 입력하고 몇 개를 선택할지 지정하세요. 앱은 입력한 항목들만 대상으로 무작위 선택합니다.
pt_br: Informe uma lista de itens e defina quantos devem ser selecionados. O app escolherá aleatoriamente apenas entre os itens fornecidos.
zh_hans: 输入一组指定项目，并设置要抽取的数量。应用只会从你提供的这些项目中随机选择。
zh_hant: 輸入一組指定項目，並設定要抽取的數量。App 只會從你提供的這些項目中隨機選擇。

# mode_help_title
source: Help
de: Hilfe
es: Ayuda
fr: Aide
ja: ヘルプ
ko: 도움말
pt_br: Ajuda
zh_hans: 帮助
zh_hant: 幫助

# mode_history_title
source: Results History
de: Ergebnisverlauf
es: Historial de resultados
fr: Historique des résultats
ja: 結果履歴
ko: 결과 기록
pt_br: Histórico de resultados
zh_hans: 结果历史
zh_hant: 結果歷史

# mode_include_title
source: Include Mode
de: Einschlussmodus
es: Modo de inclusión
fr: Mode inclusion
ja: 含有モード
ko: 포함 모드
pt_br: Modo de inclusão
zh_hans: 包含模式
zh_hant: 包含模式

# mode_results_empty_description
source: Tap Generate to create your first result.
de: Tippe auf „Generieren“, um dein erstes Ergebnis zu erstellen.
es: Toca Generar para crear tu primer resultado.
fr: Touchez Générer pour créer votre premier résultat.
ja: 「生成」をタップして最初の結果を作成します。
ko: 첫 결과를 만들려면 생성을 탭하세요.
pt_br: Toque em Gerar para criar seu primeiro resultado.
zh_hans: 点击“生成”以创建你的第一个结果。
zh_hant: 點擊「生成」以建立你的第一個結果。

# mode_results_title
source: Results
de: Ergebnisse
es: Resultados
fr: Résultats
ja: 結果
ko: 결과
pt_br: Resultados
zh_hans: 结果
zh_hant: 結果

# mode_simple_title
source: Simple Mode
de: Einfacher Modus
es: Modo simple
fr: Mode simple
ja: シンプルモード
ko: 기본 모드
pt_br: Modo simples
zh_hans: 简单模式
zh_hant: 簡單模式

# mode_specify_title
source: Specify Mode
de: Festlegungsmodus
es: Modo específico
fr: Mode spécifié
ja: 指定モード
ko: 지정 모드
pt_br: Modo especificado
zh_hans: 指定模式
zh_hant: 指定模式

# result_error_prefix
source: Error
de: Fehler
fr: Erreur
ja: エラー
ko: 오류
pt_br: Erro
zh_hans: 错误
zh_hant: 錯誤

# settings_animation_toggle
source: Enable Generating Animation
de: Animation generieren aktivieren
es: Habilitar la generación de animaciones
fr: Activer la génération d'animation
ja: アニメーション生成を有効にする
ko: 애니메이션 생성 활성화
pt_br: Habilitar Geração de Animação
zh_hans: 启用生成动画
zh_hant: 啟用生成動畫

# settings_appearance_footer
source: Light mode slightly increases contrast for readability.
de: Der helle Modus erhöht den Kontrast leicht für bessere Lesbarkeit.
es: El modo claro aumenta ligeramente el contraste para mejorar la legibilidad.
fr: Le mode clair augmente légèrement le contraste pour améliorer la lisibilité.
ja: ライトモードでは、読みやすさのためにコントラストが少し上がります。
ko: 라이트 모드는 가독성을 위해 대비를 약간 높입니다.
pt_br: O modo claro aumenta ligeiramente o contraste para melhorar a legibilidade.
zh_hans: 浅色模式会略微提升对比度，以增强可读性.
zh_hant: 淺色模式會略微提升對比度，以增強可讀性.

# settings_appearance_mode
source: Color Mode
de: Farbschema
es: Modo de color
fr: Mode de couleur
ja: カラーモード
ko: 색상 모드
pt_br: Modo de cor
zh_hans: 显示模式
zh_hant: 顯示模式

# settings_appearance_section
source: Appearance
de: Darstellung
es: Apariencia
fr: Apparence
ja: 外観
ko: 모양
pt_br: Aparência
zh_hans: 外观
zh_hant: 外觀

# settings_cancel_button
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消
zh_hant: 取消

# settings_clear_history_alert_message
source: This will delete all saved result history.
de: Alle gespeicherten Ergebnisverläufe werden gelöscht.
es: Se eliminará todo el historial de resultados guardado.
fr: Tout l’historique des résultats enregistrés sera supprimé.
ja: 保存された結果履歴がすべて削除されます。
ko: 저장된 결과 기록이 모두 삭제됩니다.
pt_br: Todo o histórico de resultados salvo será removido.
zh_hans: 这将删除所有已保存的结果历史记录.
zh_hant: 這會刪除所有已儲存的結果歷史記錄.

# settings_clear_history_alert_title
source: Clear all history?
de: Gesamten Verlauf löschen?
es: ¿Borrar todo el historial?
fr: Effacer tout l’historique ?
ja: 履歴をすべて削除しますか？
ko: 모든 기록을 삭제할까요?
pt_br: Limpar todo o histórico?
zh_hans: 清除全部历史记录？
zh_hant: 清除全部歷史記錄？

# settings_clear_history_button
source: Clear All History
de: Gesamten Verlauf löschen
es: Borrar todo el historial
fr: Effacer tout l’historique
ja: 履歴をすべて削除
ko: 전체 기록 삭제
pt_br: Limpar todo o histórico
zh_hans: 清除全部历史记录
zh_hant: 清除全部歷史記錄

# settings_confirm_button
source: Confirm
de: Bestätigen
es: Confirmar
fr: Confirmer
ja: 確認
ko: 확인
pt_br: Confirmar
zh_hans: 确认
zh_hant: 確認

# settings_contact_button
source: Email Develper
de: Entwickler per E-Mail kontaktieren
es: Enviar correo al desarrollador
fr: Envoyer un e-mail au développeur
ja: 開発者にメールする
ko: 개발자에게 이메일 보내기
pt_br: Enviar e-mail ao desenvolvedor
zh_hans: 邮件联系开发者
zh_hant: 郵件聯絡開發者

# settings_contact_footer
source: Contact support via your default mail app.
de: Kontaktiere den Support über deine Standard-Mail-App.
es: Contacta con soporte a través de tu app de correo predeterminada.
fr: Contactez l’assistance via votre app mail par défaut.
ja: デフォルトのメールアプリからサポートに連絡します。
ko: 기본 메일 앱을 통해 지원팀에 문의하세요.
pt_br: Entre em contato com o suporte pelo app de e-mail padrão.
zh_hans: 通过默认邮件 App 联系支持.
zh_hant: 透過預設郵件 App 聯絡支援.

# settings_general_section
source: Start Up & History
de: Start & Verlauf
es: Inicio e historial
fr: Demarrage et historique
ja: 起動と履歴
ko: 시작 및 기록
pt_br: Inicializacao e historico
zh_hans: 启动与历史记录
zh_hant: 啟動與歷史記錄

# settings_haptics_section
source: Haptics
de: Haptik
es: Respuesta háptica
fr: Retour haptique
ja: 触覚フィードバック
ko: 햅틱
pt_br: Tátil
zh_hans: 触感反馈
zh_hant: 觸覺回饋

# settings_haptics_toggle
source: Enable Haptics
de: Haptik aktivieren
es: Activar respuesta háptica
fr: Activer le retour haptique
ja: 触覚フィードバックを有効にする
ko: 햅틱 활성화
pt_br: Ativar feedback tátil
zh_hans: 启用触感反馈
zh_hant: 啟用觸覺回饋

# settings_highlight_current
source: Current Color
de: Aktuelle Farbe
es: Color actual
fr: Couleur actuelle
ja: 現在の色
ko: 현재 색상
pt_br: Cor atual
zh_hans: 当前颜色
zh_hant: 目前顏色

# settings_highlight_footer
source: Choose the accent color used in dark mode previews and the app theme.
de: Wähle die Akzentfarbe für Vorschauen im Dunkelmodus und das App-Design.
es: Elige el color de acento usado en las vistas previas del modo oscuro y en el tema de la app.
fr: Choisissez la couleur d’accent utilisée dans les aperçus du mode sombre et le thème de l’app.
ja: ダークモードのプレビューとアプリのテーマに使うアクセントカラーを選択します。
ko: 다크 모드 미리보기와 앱 테마에 사용할 강조 색상을 선택합니다.
pt_br: Escolha a cor de destaque usada nas prévias do modo escuro e no tema do app.
zh_hans: 选择用于深色模式预览和应用主题的高亮颜色.
zh_hant: 選擇用於深色模式預覽和 App 主題的強調顏色.

# settings_highlight_picker
source: Pick Highlight Color
de: Akzentfarbe wählen
es: Elegir color de acento
fr: Choisir la couleur d’accent
ja: アクセントカラーを選択
ko: 강조 색상 선택
pt_br: Escolher cor de destaque
zh_hans: 选择高亮颜色
zh_hant: 選擇強調顏色

# settings_highlight_reset
source: Reset to Default
de: Auf Standard zurücksetzen
es: Restablecer por defecto
fr: Réinitialiser par défaut
ja: デフォルトに戻す
ko: 기본값으로 재설정
pt_br: Restaurar padrão
zh_hans: 恢复默认
zh_hant: 恢復預設

# settings_highlight_section
source: Highlight Color
de: Akzentfarbe
es: Color de acento
fr: Couleur d’accent
ja: アクセントカラー
ko: 강조 색상
pt_br: Cor de destaque
zh_hans: 高亮颜色
zh_hant: 強調顏色

# settings_language_button
source: Open App Language Settings
de: App-Spracheinstellungen öffnen
es: Abrir ajustes de idioma de la app
fr: Ouvrir les réglages de langue de l’app
ja: アプリの言語設定を開く
ko: 앱 언어 설정 열기
pt_br: Abrir ajustes de idioma do app
zh_hans: 打开 App 语言设置
zh_hant: 打開 App 語言設定

# settings_language_footer
source: Choose preferred language in System Settings.
de: Ändere die App-Sprache in den Systemeinstellungen.
es: Cambia el idioma de la app en Ajustes del sistema.
fr: Modifiez la langue de l’app dans Réglages.
ja: システム設定でアプリの言語を変更します。
ko: 시스템 설정에서 앱 언어를 변경하세요.
pt_br: Altere o idioma do app nos Ajustes do sistema.
zh_hans: 在系统设置中修改 App 语言.
zh_hant: 在系統設定中修改 App 語言.

# settings_language_section
source: Language
de: Sprache
es: Idioma
fr: Langue
ja: 言語
ko: 언어
pt_br: Idioma
zh_hans: 语言
zh_hant: 語言

# settings_misc_footer
source: Select preferred font, font size and other settings.
de: Wählen Sie Ihre bevorzugte Schriftart, Schriftgröße und weitere Einstellungen aus.
es: Seleccione la fuente preferida, el tamaño de fuente y otros ajustes.
fr: Sélectionnez la police, la taille de police et les autres paramètres de votre choix.
ja: お好みのフォント、フォントサイズ、その他の設定を選択してください。
ko: 원하는 글꼴, 글꼴 크기 및 기타 설정을 선택하세요.
pt_br: Selecione a fonte preferida, o tamanho da fonte e outras configurações.
zh_hant: 選擇喜歡的字體、字號和其他設定。

# settings_misc_section
source: Miscellaneous
de: Sonstiges
es: Varios
fr: Divers
ja: その他
ko: 기타
pt_br: Diversos
zh_hans: 杂项
zh_hant: 雜項

# settings_reset_accent_alert_message
source: This will restore the default accent color.
de: Dadurch wird die Standard-Akzentfarbe wiederhergestellt.
es: Esto restaurará el color de acento predeterminado.
fr: Cela rétablira la couleur d’accentuation par défaut.
ja: デフォルトのアクセントカラーに戻します。
ko: 기본 강조 색상으로 복원합니다.
pt_br: Isso restaurará a cor de destaque padrão.
zh_hans: 这将恢复默认强调色.
zh_hant: 這將恢復預設強調色.

# settings_reset_accent_alert_title
source: Reset accent color?
de: Akzentfarbe zurücksetzen?
es: ¿Restablecer color de acento?
fr: Réinitialiser la couleur d’accentuation ?
ja: アクセントカラーをリセットしますか？
ko: 강조 색상을 재설정할까요?
pt_br: Redefinir cor de destaque?
zh_hans: 重置强调色？
zh_hant: 重設強調色？

# settings_reset_all_alert_message
source: This will reset all settings to their default values, but it will not clear your history.
de: Alle Einstellungen werden auf die Standardwerte zuruckgesetzt, aber der Verlauf wird nicht geloscht.
es: Esto restablecera todos los ajustes a sus valores predeterminados, pero no borrara tu historial.
fr: Cela reinitialisera tous les reglages a leurs valeurs par defaut, sans effacer votre historique.
ja: すべての設定をデフォルトに戻しますが、履歴は削除されません。
ko: 모든 설정이 기본값으로 재설정되지만 기록은 삭제되지 않습니다.
pt_br: Isso redefinira todas as configuracoes para os valores padrao, mas nao limpara seu historico.
zh_hans: 这会将所有设置恢复为默认值，但不会清除历史记录。
zh_hant: 這會將所有設定恢復為預設值，但不會清除歷史記錄。

# settings_reset_all_alert_title
source: Reset all settings?
de: Alle Einstellungen zurucksetzen?
es: Restablecer todos los ajustes?
fr: Reinitialiser tous les reglages ?
ja: すべての設定をリセットしますか？
ko: 모든 설정을 재설정할까요?
pt_br: Redefinir todas as configuracoes?
zh_hans: 重置所有设置？
zh_hant: 重設所有設定？

# settings_reset_all_button
source: Reset All Settings to Default
de: Alle Einstellungen auf Standard zurucksetzen
es: Restablecer todos los ajustes por defecto
fr: Reinitialiser tous les reglages par defaut
ja: すべての設定をデフォルトに戻す
ko: 모든 설정을 기본값으로 재설정
pt_br: Redefinir todas as configuracoes para o padrao
zh_hans: 将所有设置恢复为默认
zh_hant: 將所有設定恢復為預設
